garyPenhook/PIC-Assembler/edc/PIC18F46Q43.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U3CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U3CTSPPS" edc:nzwidth="8" edc:por="--000110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x277">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3CTSPPS" edc:mask="0x3f" edc:name="U3CTSPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U3CTSPPS0" edc:mask="0x1" edc:name="U3CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS1" edc:mask="0x1" edc:name="U3CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS2" edc:mask="0x1" edc:name="U3CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS3" edc:mask="0x1" edc:name="U3CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS4" edc:mask="0x1" edc:name="U3CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS5" edc:mask="0x1" edc:name="U3CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U4RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U4RXPPS" edc:nzwidth="8" edc:por="---01101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x278">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4RXPPS" edc:mask="0x1f" edc:name="U4RXPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U4RXPPS0" edc:mask="0x1" edc:name="U4RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4RXPPS1" edc:mask="0x1" edc:name="U4RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4RXPPS2" edc:mask="0x1" edc:name="U4RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4RXPPS3" edc:mask="0x1" edc:name="U4RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4RXPPS4" edc:mask="0x1" edc:name="U4RXPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U4CTSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U4CTSPPS" edc:nzwidth="8" edc:por="---01100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x279">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4CTSPPS" edc:mask="0x1f" edc:name="U4CTSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U4CTSPPS0" edc:mask="0x1" edc:name="U4CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4CTSPPS1" edc:mask="0x1" edc:name="U4CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4CTSPPS2" edc:mask="0x1" edc:name="U4CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4CTSPPS3" edc:mask="0x1" edc:name="U4CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4CTSPPS4" edc:mask="0x1" edc:name="U4CTSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U5RXPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U5RXPPS" edc:nzwidth="8" edc:por="--000101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x27A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U5RXPPS" edc:mask="0x3f" edc:name="U5RXPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U5RXPPS0" edc:mask="0x1" edc:name="U5RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5RXPPS1" edc:mask="0x1" edc:name="U5RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5RXPPS2" edc:mask="0x1" edc:name="U5RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5RXPPS3" edc:mask="0x1" edc:name="U5RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5RXPPS4" edc:mask="0x1" edc:name="U5RXPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5RXPPS5" edc:mask="0x1" edc:name="U5RXPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U5CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U5CTSPPS" edc:nzwidth="8" edc:por="--000100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x27B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U5CTSPPS" edc:mask="0x3f" edc:name="U5CTSPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U5CTSPPS0" edc:mask="0x1" edc:name="U5CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5CTSPPS1" edc:mask="0x1" edc:name="U5CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5CTSPPS2" edc:mask="0x1" edc:name="U5CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5CTSPPS3" edc:mask="0x1" edc:name="U5CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5CTSPPS4" edc:mask="0x1" edc:name="U5CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5CTSPPS5" edc:mask="0x1" edc:name="U5CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xA" edc:_addr="0x27C"/>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RC4I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RC4I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x286">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
