garyPenhook/PIC-Assembler/edc/PIC18F46Q43.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="U4RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U4RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2DA">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U4RXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2DB"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U4TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2DC">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U4TXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2DD"/>
        <edc:JoinedSFRDef edc:cname="U4P1" edc:desc="" edc:name="U4P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2DE">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U4P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2DE">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1L" edc:desc="" edc:mask="0xff" edc:name="P1L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2DF"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U4P2" edc:desc="" edc:name="U4P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E0">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U4P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E0">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P2L" edc:desc="" edc:mask="0xff" edc:name="P2L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2E1"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U4P3" edc:desc="" edc:name="U4P3" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E2">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4P3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="U4P3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P3L" edc:desc="" edc:mask="0xff" edc:name="P3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2E3"/>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U4CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U4CON0" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U4MODE" edc:desc="" edc:mask="0x7" edc:name="U4MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="U4RXEN" edc:desc="" edc:mask="0x1" edc:name="U4RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXEN" edc:desc="" edc:mask="0x1" edc:name="U4TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4ABDEN" edc:desc="" edc:mask="0x1" edc:name="U4ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4BRGS" edc:desc="" edc:mask="0x1" edc:name="U4BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U4MODE0" edc:desc="" edc:mask="0x1" edc:name="U4MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4MODE1" edc:desc="" edc:mask="0x1" edc:name="U4MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4MODE2" edc:desc="" edc:mask="0x1" edc:name="U4MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGS" edc:desc="" edc:mask="0x1" edc:name="BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--nn-nn" edc:cname="U4CON1" edc:desc="" edc:impl="0x9b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00-00" edc:name="U4CON1" edc:nzwidth="8" edc:por="0--00-00" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRKOVR" edc:desc="" edc:mask="0x1" edc:name="BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXBIMD" edc:desc="" edc:mask="0x1" edc:name="RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4SENDB" edc:desc="" edc:mask="0x1" edc:name="U4SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4BRKOVR" edc:desc="" edc:mask="0x1" edc:name="U4BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4RXBIMD" edc:desc="" edc:mask="0x1" edc:name="U4RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4WUE" edc:desc="" edc:mask="0x1" edc:name="U4WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U4ON" edc:desc="" edc:mask="0x1" edc:name="U4ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U4CON2" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U4CON2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLO" edc:desc="" edc:mask="0x3" edc:name="FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TXPOL" edc:desc="" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x3" edc:name="STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXPOL" edc:desc="" edc:mask="0x1" edc:name="RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RUNOVF" edc:desc="" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLO0" edc:desc="" edc:mask="0x1" edc:name="FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLO1" edc:desc="" edc:mask="0x1" edc:name="FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="STP0" edc:desc="" edc:mask="0x1" edc:name="STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP1" edc:desc="" edc:mask="0x1" edc:name="STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U4FLO" edc:desc="" edc:mask="0x3" edc:name="U4FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U4TXPOL" edc:desc="" edc:mask="0x1" edc:name="U4TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4STP" edc:desc="" edc:mask="0x3" edc:name="U4STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U4RXPOL" edc:desc="" edc:mask="0x1" edc:name="U4RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RUNOVF" edc:desc="" edc:mask="0x1" edc:name="U4RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U4FLO0" edc:desc="" edc:mask="0x1" edc:name="U4FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4FLO1" edc:desc="" edc:mask="0x1" edc:name="U4FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U4STP0" edc:desc="" edc:mask="0x1" edc:name="U4STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4STP1" edc:desc="" edc:mask="0x1" edc:name="U4STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="U4BRG" edc:desc="" edc:name="U4BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U4BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGL" edc:desc="" edc:mask="0xff" edc:name="BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U4BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0xff" edc:name="BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
