garyPenhook/PIC-Assembler/edc/PIC18F46Q43.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="CWG1AS1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="CWG1AS1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS0E" edc:desc="" edc:mask="0x1" edc:name="AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS1E" edc:desc="" edc:mask="0x1" edc:name="AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS2E" edc:desc="" edc:mask="0x1" edc:name="AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS3E" edc:desc="" edc:mask="0x1" edc:name="AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS4E" edc:mask="0x1" edc:name="AS4E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS5E" edc:mask="0x1" edc:name="AS5E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS6E" edc:mask="0x1" edc:name="AS6E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS7E" edc:mask="0x1" edc:name="AS7E" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CWG1STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CWG1STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRA" edc:desc="" edc:mask="0x1" edc:name="OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRB" edc:desc="" edc:mask="0x1" edc:name="OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRC" edc:desc="" edc:mask="0x1" edc:name="OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRD" edc:desc="" edc:mask="0x1" edc:name="OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1STRA" edc:desc="" edc:mask="0x1" edc:name="CWG1STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRB" edc:desc="" edc:mask="0x1" edc:name="CWG1STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRC" edc:desc="" edc:mask="0x1" edc:name="CWG1STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRD" edc:desc="" edc:mask="0x1" edc:name="CWG1STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRA" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRB" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRC" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRD" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="CWG2CLK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="CWG2CLK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C5">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG2CLKCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG2CS" edc:mask="0x1" edc:name="CWG2CS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG2ISM" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="CWG2ISM" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C6">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG2DAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISM" edc:mask="0x1f" edc:name="ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG2ISM" edc:mask="0x1f" edc:name="CWG2ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISM0" edc:mask="0x1" edc:name="ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM1" edc:mask="0x1" edc:name="ISM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM2" edc:mask="0x1" edc:name="ISM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM3" edc:mask="0x1" edc:name="ISM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM4" edc:mask="0x1" edc:name="ISM4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG2DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG2DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG2DBR" edc:mask="0x3f" edc:name="CWG2DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG2DBR0" edc:mask="0x1" edc:name="CWG2DBR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBR1" edc:mask="0x1" edc:name="CWG2DBR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBR2" edc:mask="0x1" edc:name="CWG2DBR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBR3" edc:mask="0x1" edc:name="CWG2DBR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBR4" edc:mask="0x1" edc:name="CWG2DBR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBR5" edc:desc="" edc:mask="0x1" edc:name="CWG2DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG2DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG2DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF" edc:desc="" edc:mask="0x3f" edc:name="DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG2DBF" edc:desc="" edc:mask="0x3f" edc:name="CWG2DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG2DBF0" edc:mask="0x1" edc:name="CWG2DBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBF1" edc:mask="0x1" edc:name="CWG2DBF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBF2" edc:mask="0x1" edc:name="CWG2DBF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBF3" edc:mask="0x1" edc:name="CWG2DBF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBF4" edc:mask="0x1" edc:name="CWG2DBF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2DBF5" edc:mask="0x1" edc:name="CWG2DBF5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="CWG2CON0" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="CWG2CON0" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G2EN" edc:mask="0x1" edc:name="G2EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG2MODE" edc:mask="0x7" edc:name="CWG2MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CWG2LD" edc:mask="0x1" edc:name="CWG2LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2EN" edc:mask="0x1" edc:name="CWG2EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG2MODE0" edc:mask="0x1" edc:name="CWG2MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2MODE1" edc:mask="0x1" edc:name="CWG2MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2MODE2" edc:mask="0x1" edc:name="CWG2MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--r-nnnn" edc:cname="CWG2CON1" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--x-0000" edc:name="CWG2CON1" edc:nzwidth="0x8" edc:por="--x-0000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3CA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IN" edc:desc="" edc:mask="0x1" edc:name="IN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG2POLA" edc:mask="0x1" edc:name="CWG2POLA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2POLB" edc:mask="0x1" edc:name="CWG2POLB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2POLC" edc:mask="0x1" edc:name="CWG2POLC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2POLD" edc:desc="" edc:mask="0x1" edc:name="CWG2POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2IN" edc:mask="0x1" edc:name="CWG2IN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="CWG2AS0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000101--" edc:name="CWG2AS0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3CB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LSAC" edc:desc="" edc:mask="0x3" edc:name="LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LSDBD" edc:desc="" edc:mask="0x3" edc:name="LSDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REN" edc:desc="" edc:mask="0x1" edc:name="REN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHUTDOWN" edc:desc="" edc:mask="0x1" edc:name="SHUTDOWN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LSAC0" edc:desc="" edc:mask="0x1" edc:name="LSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSCA1" edc:desc="" edc:mask="0x1" edc:name="LSCA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB0" edc:desc="" edc:mask="0x1" edc:name="LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB1" edc:desc="" edc:mask="0x1" edc:name="LSDB1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CWG2LSAC0" edc:mask="0x1" edc:name="CWG2LSAC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2LSAC1" edc:mask="0x1" edc:name="CWG2LSAC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2LSDB0" edc:mask="0x1" edc:name="CWG2LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2LSDB1" edc:mask="0x1" edc:name="CWG2LSDB1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CWG2LSAC" edc:mask="0x3" edc:name="CWG2LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CWG2LSDB" edc:mask="0x3" edc:name="CWG2LSDB" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LSBD" edc:desc="" edc:mask="0x3" edc:name="LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LSAC1" edc:desc="" edc:mask="0x1" edc:name="LSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD0" edc:desc="" edc:mask="0x1" edc:name="LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD1" edc:desc="" edc:mask="0x1" edc:name="LSBD1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG2LSBD0" edc:mask="0x1" edc:name="CWG2LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2LSBD1" edc:mask="0x1" edc:name="CWG2LSBD1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.6">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG2LSBD" edc:mask="0x3" edc:name="CWG2LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
