garyPenhook/PIC-Assembler/edc/PIC18F46Q43.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1INCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1INCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x444">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xff" edc:name="INC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC8" edc:desc="" edc:mask="0x1" edc:name="NCO1INC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC9" edc:desc="" edc:mask="0x1" edc:name="NCO1INC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC10" edc:desc="" edc:mask="0x1" edc:name="NCO1INC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC11" edc:desc="" edc:mask="0x1" edc:name="NCO1INC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC12" edc:desc="" edc:mask="0x1" edc:name="NCO1INC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC13" edc:desc="" edc:mask="0x1" edc:name="NCO1INC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC14" edc:desc="" edc:mask="0x1" edc:name="NCO1INC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC15" edc:desc="" edc:mask="0x1" edc:name="NCO1INC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC8" edc:mask="0x1" edc:name="INC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC9" edc:mask="0x1" edc:name="INC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC10" edc:mask="0x1" edc:name="INC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC11" edc:mask="0x1" edc:name="INC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC12" edc:mask="0x1" edc:name="INC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC13" edc:mask="0x1" edc:name="INC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC14" edc:mask="0x1" edc:name="INC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC15" edc:mask="0x1" edc:name="INC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:mask="0xff" edc:name="NCO1INC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO1INCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO1INCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x445">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xf" edc:name="INC" edc:nzwidth="4"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC16" edc:desc="" edc:mask="0x1" edc:name="NCO1INC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC17" edc:desc="" edc:mask="0x1" edc:name="NCO1INC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC18" edc:desc="" edc:mask="0x1" edc:name="NCO1INC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC19" edc:desc="" edc:mask="0x1" edc:name="NCO1INC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC16" edc:mask="0x1" edc:name="INC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC17" edc:mask="0x1" edc:name="INC17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC18" edc:mask="0x1" edc:name="INC18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC19" edc:mask="0x1" edc:name="INC19" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:mask="0xf" edc:name="NCO1INC" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="NCO1CON" edc:desc="Configurable logic cell control" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="NCO1CON" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x446">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PFM" edc:desc="" edc:mask="0x1" edc:name="PFM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NCO1PFM" edc:mask="0x1" edc:name="NCO1PFM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NCO1POL" edc:mask="0x1" edc:name="NCO1POL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1OUT" edc:mask="0x1" edc:name="NCO1OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCO1EN" edc:mask="0x1" edc:name="NCO1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1CLK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1CLK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x447">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKS" edc:desc="" edc:mask="0x1f" edc:name="CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="PWS" edc:desc="" edc:mask="0x7" edc:name="PWS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKS0" edc:mask="0x1" edc:name="CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS1" edc:mask="0x1" edc:name="CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS2" edc:mask="0x1" edc:name="CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS3" edc:mask="0x1" edc:name="CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS4" edc:mask="0x1" edc:name="CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS0" edc:mask="0x1" edc:name="PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS1" edc:mask="0x1" edc:name="PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS2" edc:mask="0x1" edc:name="PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NCO1CKS" edc:mask="0x1f" edc:name="NCO1CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS" edc:mask="0x7" edc:name="NCO1PWS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="NCO1CKS0" edc:mask="0x1" edc:name="NCO1CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS1" edc:mask="0x1" edc:name="NCO1CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS2" edc:mask="0x1" edc:name="NCO1CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS3" edc:mask="0x1" edc:name="NCO1CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS4" edc:mask="0x1" edc:name="NCO1CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS0" edc:mask="0x1" edc:name="NCO1PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS1" edc:mask="0x1" edc:name="NCO1PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS2" edc:mask="0x1" edc:name="NCO1PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="NCO2ACC" edc:desc="" edc:name="NCO2ACC" edc:nzwidth="0x18" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x448">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO2ACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO2ACCL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x448">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xff" edc:name="ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO2ACC0" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC1" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC2" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC3" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC4" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC5" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC6" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC7" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC0" edc:mask="0x1" edc:name="ACC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC1" edc:mask="0x1" edc:name="ACC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC2" edc:mask="0x1" edc:name="ACC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC3" edc:mask="0x1" edc:name="ACC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC4" edc:mask="0x1" edc:name="ACC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC5" edc:mask="0x1" edc:name="ACC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC6" edc:mask="0x1" edc:name="ACC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC7" edc:mask="0x1" edc:name="ACC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO2ACC" edc:mask="0xff" edc:name="NCO2ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO2ACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO2ACCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x449">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xff" edc:name="ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO2ACC8" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC9" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC10" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC11" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC12" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC13" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC14" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC15" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC8" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO2ACC" edc:mask="0xff" edc:name="NCO2ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO2ACCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO2ACCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x44A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xf" edc:name="ACC" edc:nzwidth="4"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO2ACC16" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC17" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC18" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2ACC19" edc:desc="" edc:mask="0x1" edc:name="NCO2ACC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC16" edc:mask="0x1" edc:name="ACC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC17" edc:mask="0x1" edc:name="ACC17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC18" edc:mask="0x1" edc:name="ACC18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC19" edc:mask="0x1" edc:name="ACC19" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO2ACC" edc:mask="0xf" edc:name="NCO2ACC" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="NCO2INC" edc:desc="" edc:name="NCO2INC" edc:nzwidth="0x18" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x44B">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO2INCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000001" edc:name="NCO2INCL" edc:nzwidth="8" edc:por="00000001" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x44B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xff" edc:name="INC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO2INC0" edc:desc="" edc:mask="0x1" edc:name="NCO2INC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC1" edc:desc="" edc:mask="0x1" edc:name="NCO2INC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC2" edc:desc="" edc:mask="0x1" edc:name="NCO2INC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC3" edc:desc="" edc:mask="0x1" edc:name="NCO2INC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC4" edc:desc="" edc:mask="0x1" edc:name="NCO2INC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC5" edc:desc="" edc:mask="0x1" edc:name="NCO2INC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC6" edc:desc="" edc:mask="0x1" edc:name="NCO2INC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC7" edc:desc="" edc:mask="0x1" edc:name="NCO2INC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC0" edc:mask="0x1" edc:name="INC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC1" edc:mask="0x1" edc:name="INC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC2" edc:mask="0x1" edc:name="INC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC3" edc:mask="0x1" edc:name="INC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC4" edc:mask="0x1" edc:name="INC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC5" edc:mask="0x1" edc:name="INC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC6" edc:mask="0x1" edc:name="INC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC7" edc:mask="0x1" edc:name="INC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO2INC" edc:mask="0xff" edc:name="NCO2INC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO2INCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO2INCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x44C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xff" edc:name="INC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO2INC8" edc:desc="" edc:mask="0x1" edc:name="NCO2INC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC9" edc:desc="" edc:mask="0x1" edc:name="NCO2INC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC10" edc:desc="" edc:mask="0x1" edc:name="NCO2INC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC11" edc:desc="" edc:mask="0x1" edc:name="NCO2INC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC12" edc:desc="" edc:mask="0x1" edc:name="NCO2INC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC13" edc:desc="" edc:mask="0x1" edc:name="NCO2INC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC14" edc:desc="" edc:mask="0x1" edc:name="NCO2INC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC15" edc:desc="" edc:mask="0x1" edc:name="NCO2INC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC8" edc:mask="0x1" edc:name="INC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC9" edc:mask="0x1" edc:name="INC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC10" edc:mask="0x1" edc:name="INC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC11" edc:mask="0x1" edc:name="INC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC12" edc:mask="0x1" edc:name="INC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC13" edc:mask="0x1" edc:name="INC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC14" edc:mask="0x1" edc:name="INC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC15" edc:mask="0x1" edc:name="INC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO2INC" edc:mask="0xff" edc:name="NCO2INC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
