garyPenhook/PIC-Assembler/edc/PIC18F46Q43.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO3ACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO3ACCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x451">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xff" edc:name="ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO3ACC8" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC9" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC10" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC11" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC12" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC13" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC14" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC15" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC8" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO3ACC" edc:mask="0xff" edc:name="NCO3ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO3ACCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO3ACCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x452">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xf" edc:name="ACC" edc:nzwidth="4"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO3ACC16" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC17" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC18" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC19" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC16" edc:mask="0x1" edc:name="ACC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC17" edc:mask="0x1" edc:name="ACC17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC18" edc:mask="0x1" edc:name="ACC18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC19" edc:mask="0x1" edc:name="ACC19" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO3ACC" edc:mask="0xf" edc:name="NCO3ACC" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="NCO3INC" edc:desc="" edc:name="NCO3INC" edc:nzwidth="0x18" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x453">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO3INCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000001" edc:name="NCO3INCL" edc:nzwidth="8" edc:por="00000001" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x453">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xff" edc:name="INC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO3INC0" edc:desc="" edc:mask="0x1" edc:name="NCO3INC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC1" edc:desc="" edc:mask="0x1" edc:name="NCO3INC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC2" edc:desc="" edc:mask="0x1" edc:name="NCO3INC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC3" edc:desc="" edc:mask="0x1" edc:name="NCO3INC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC4" edc:desc="" edc:mask="0x1" edc:name="NCO3INC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC5" edc:desc="" edc:mask="0x1" edc:name="NCO3INC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC6" edc:desc="" edc:mask="0x1" edc:name="NCO3INC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC7" edc:desc="" edc:mask="0x1" edc:name="NCO3INC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC0" edc:mask="0x1" edc:name="INC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC1" edc:mask="0x1" edc:name="INC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC2" edc:mask="0x1" edc:name="INC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC3" edc:mask="0x1" edc:name="INC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC4" edc:mask="0x1" edc:name="INC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC5" edc:mask="0x1" edc:name="INC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC6" edc:mask="0x1" edc:name="INC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC7" edc:mask="0x1" edc:name="INC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO3INC" edc:mask="0xff" edc:name="NCO3INC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO3INCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO3INCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x454">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xff" edc:name="INC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO3INC8" edc:desc="" edc:mask="0x1" edc:name="NCO3INC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC9" edc:desc="" edc:mask="0x1" edc:name="NCO3INC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC10" edc:desc="" edc:mask="0x1" edc:name="NCO3INC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC11" edc:desc="" edc:mask="0x1" edc:name="NCO3INC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC12" edc:desc="" edc:mask="0x1" edc:name="NCO3INC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC13" edc:desc="" edc:mask="0x1" edc:name="NCO3INC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC14" edc:desc="" edc:mask="0x1" edc:name="NCO3INC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC15" edc:desc="" edc:mask="0x1" edc:name="NCO3INC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC8" edc:mask="0x1" edc:name="INC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC9" edc:mask="0x1" edc:name="INC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC10" edc:mask="0x1" edc:name="INC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC11" edc:mask="0x1" edc:name="INC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC12" edc:mask="0x1" edc:name="INC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC13" edc:mask="0x1" edc:name="INC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC14" edc:mask="0x1" edc:name="INC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC15" edc:mask="0x1" edc:name="INC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO3INC" edc:mask="0xff" edc:name="NCO3INC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
